word = input("Введіть слово: ")

# Створюємо пустий словник для зберігання кількості кожного символу
char_count = {}

# Цикл для перебору кожного символу у слові
for char in word:
    # Перевіряємо, чи символ вже є у словнику
    if char in char_count:
        # Якщо так, збільшуємо лічильник для цього символу на 1
        char_count[char] += 1
    else:
        # Якщо ні, додаємо цей символ до словника з лічильником 1
        char_count[char] = 1

# Виводимо кількість різних символів та їх кількість
print("Кількість різних символів у слові:", len(char_count))
print("Різні символи та їх кількість:")
for char, count in char_count.items():
    print(char, ":", count)
