#! /usr/bin/env python
# -*- coding: utf-8 -*-

from __future__ import print_function

# Завдання 1
# Написати програму, яка обчислює значення X  в залежності від значень a та b, введених користувачем з клавіатури.
# У варіантах 1-10 числа a та b можуть бути лише додатніми, у варіантах 10-20 можуть приймати значення від 1 до 100.
# Реалізувати у програмі перевірку чисел a та b, введених користувачем1

a = float(input('Введіть число a: '))

while a < 0:
    print('Число, яке Ви ввели є від\'ємним. Будь ласка, введіть нове ДОДАТНЄ значення a: ')
    a = float(input())
print('Введіть число b: ')

b = float(input())

while b < 0:
    print('Число, яке Ви ввели є від\'ємним. Будь ласка, введіть нове ДОДАТНЄ значення b: ')
    b = float(input())

if a > b:
    x = a * b - 3
    print(float(x))
elif a == b:
    x = 2
    print(float(x))
elif a < b:
    x = (a ** 3 + 1) / b
    print(float(x))
